trade_exp/src/DataProcessors/ЗагрузкаТоваровИзВнешнихФайлов/ЗагрузкаТоваровИзВнешнихФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="be362f21-420b-4b26-aa8a-c81cb604988a">
  <name>ЗагрузкаТоваровИзВнешнихФайлов</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ef115090-8fca-4521-9bd1-ecc07f568bec">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3a3a65ce-80a9-435f-9aa2-21d5add59229">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa1025d7-0232-4124-8a64-816e44306389">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/DataProcessors/ЗагрузкаТоваровИзВнешнихФайлов/Forms/ФормаПроверкиЦенников/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;    
	ВидЦены = Параметры.ВидЦены;
	ДопСведение = Параметры.ДополнительноеСведение;
	ДатаДокумента = Параметры.ДатаДокумента;    
	ИнициализироватьТабличныйДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	МакетЗаполненияПоВнешнемуИсточнику = Обработки.ЗагрузкаТоваровИзВнешнихФайлов.ПолучитьМакет("МакетПроверкиЦенников");
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент.Очистить();                          
	
	ТабличныйДокумент.Присоединить(ОбластьТовары);               
	
	ТабличныйДокумент.ФиксацияСверху = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаявку(Команда)
	ЗаполненыНоменклатураКодНоменклатура = ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C1").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C2").Текст);
	
	Если Не ЗаполненыНоменклатураКодНоменклатура Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла.'"));
		Возврат;
	КонецЕсли;
	
	Если СопоставленыДанныеТабличногоДокументаСДаннымиИБ() Тогда 
		ЗаполнениеТаблицы();
		ПеренестиТовары();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция СопоставленыДанныеТабличногоДокументаСДаннымиИБ()
	
	ТоварыДляДокумента.Очистить();
	НомерСтроки = 2 ;
	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	ЗаполненыНоменклатураКодНоменклатура=ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст);
	
	Пока ЗаполненыНоменклатураКодНоменклатура Цикл                             
		Код=ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст;   
		Номенклатура=ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст; 
		НоменклатураСсылка=""; 
		
		Если ЗначениеЗаполнено(Код) И НЕ ЗначениеЗаполнено(НоменклатураСсылка) Тогда
			НоменклатураСсылка = Справочники.Номенклатура.НайтиПоКоду(Код);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Номенклатура) И НЕ ЗначениеЗаполнено(НоменклатураСсылка) Тогда
			НоменклатураСсылка=Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура, Истина);
		КонецЕсли;            
		
		Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда  
			Стр=ТоварыДляДокумента.Добавить();
			Стр.Код = НоменклатураСсылка.Код;       
			Стр.Номенклатура=НоменклатураСсылка;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Номенклатура не найдена. Проверьте корректность введенных данных и попробуйте заново.";      
			Сообщение.Сообщить();
		КонецЕсли;	
		НомерСтроки = НомерСтроки+1 ;
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		ЗаполненыНоменклатураКодНоменклатура=ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C1").Текст)
			Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + "C2").Текст);

	КонецЦикла;	                                   
	
	Возврат  ЗначениеЗаполнено(НоменклатураСсылка);
	
КонецФункции   

Процедура ЗаполнениеТаблицы()
                                                    	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВР_таблица
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_таблица.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаТекущая,
		|	ДополнительныеСведения.Значение КАК ДополнительноеСведение,
		|	ДополнительныеСведения.Свойство КАК Свойство
		|ИЗ
		|	ВР_таблица КАК ВР_таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВР_таблица.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ВР_таблица.Номенклатура = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство = &ДополнительныеСведения)";      
	
	Запрос.УстановитьПараметр("Таблица", ТоварыДляДокумента.Выгрузить());
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Период", ДатаДокумента);
	Запрос.УстановитьПараметр("ДополнительныеСведения", ДопСведение);
	РезультатЗапроса = Запрос.Выполнить();     
	ТоварыДляДокумента.Загрузить(РезультатЗапроса.Выгрузить());	
КонецПроцедуры  

&НаКлиенте
Процедура ПеренестиТовары()
		АдресТоваровВХранилище = ПоместитьТоварыВХранилище();
		Закрыть(АдресТоваровВХранилище);
КонецПроцедуры

&НаСервере
Функция ПоместитьТоварыВХранилище()
	ТоварыНаПроверку = ТоварыДляДокумента.Выгрузить();
	ТоварыДляДокумента.Очистить();
	
	Возврат ПоместитьВоВременноеХранилище(ТоварыНаПроверку);
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	  Закрыть();
КонецПроцедуры
